Функция СведенияОВнешнейОбработке() Экспорт
		
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Информация = НСтр("ru = '" + "Обновление расширений из github" + "'");
	ПараметрыРегистрации.Версия = "v1.0.2";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Обновление расширений из github";
	НоваяКоманда.Идентификатор = "Обновление расширений из github";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура УстановитьРасширениеНаСервере(АдресХранилища, ИмяФайла, ИмяОбъекта) Экспорт
	
	Расширение = ПолучитьРасширениеФайла(ИмяФайла); 
	Если НРег(Расширение) = "cfe" Тогда 
		
		Если ЗначениеЗаполнено(ИмяОбъекта) Тогда 
			
			МассивРасширений = РасширенияКонфигурации.Получить(Новый Структура("Имя",ИмяОбъекта));
			
			Если МассивРасширений.Количество() = 0 Тогда
				ТекущееРасширение = РасширенияКонфигурации.Создать();
			Иначе	
				ТекущееРасширение = МассивРасширений[0];
			КонецЕсли;
			
		Иначе 
			ТекущееРасширение = РасширенияКонфигурации.Создать(ПолучитьИзВременногоХранилища(АдресХранилища));  
     
			ИмяОбъекта = ТекущееРасширение.Имя;//запоминаем для определения текущей версии 
		КонецЕсли;
		
		ТекущееРасширение.БезопасныйРежим = Ложь;  
		ТекущееРасширение.ОбластьДействия = ОбластьДействияРасширенияКонфигурации.ИнформационнаяБаза;
		ТекущееРасширение.Записать(ПолучитьИзВременногоХранилища(АдресХранилища)); 		
		
	ИначеЕсли НРег(Расширение) = "epf" ИЛИ НРег(Расширение) = "erf" Тогда 
		
		//доп обработка
		Сведения = СведенияОВнешнейОбработкеИзФайла(АдресХранилища, ИмяФайла);     
		Если Сведения = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ДопОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта",Сведения.ИмяОбъекта);
		Если ЗначениеЗаполнено(Сведения) И НЕ ЗначениеЗаполнено(ИмяОбъекта) Тогда 
			ИмяОбъекта = Сведения.ИмяОбъекта;
		КонецЕсли;
				
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("Имя",Сведения.ИмяОбъекта); 
		ПараметрыОбработки.Вставить("ДвоичныеДанные",ПолучитьИзВременногоХранилища(АдресХранилища));
		ПараметрыОбработки.Вставить("Ссылка",?(ЗначениеЗаполнено(ДопОбработкаСсылка),ДопОбработкаСсылка,Неопределено));
		ПараметрыОбработки.Вставить("Вид","ОБРАБОТКА"); 
		//обновляем только двоичные данные, версию и информацию, остальное остается как было
		ПараметрыОбработки.Вставить("Сведения",Новый Структура("Наименование, БезопасныйРежим, Версия, Информация",Сведения.Наименование,Сведения.БезопасныйРежим,Сведения.Версия,Сведения.Версия));
		ПараметрыОбработки.Вставить("ИмяФайла",ИмяФайла);
		ПараметрыОбработки.Вставить("ИмяМакета","");  
		ПараметрыОбработки.Вставить("Команды",Сведения.Команды);
		
		ЗарегистрироватьОбработку(ПараметрыОбработки);
		
	КонецЕсли;
		 
КонецПроцедуры     

//см. ДополнительныеотчетыИОбработки.ЗарегистрироватьОтчетыИОбработки
Процедура ЗарегистрироватьОбработку(ПараметрыОбработки)
	
	// Обновление/добавление.
	Если ПараметрыОбработки.Ссылка = Неопределено Тогда
		СправочникОбъект = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		СправочникОбъект.ИспользоватьДляФормыОбъекта = Истина;
		СправочникОбъект.ИспользоватьДляФормыСписка  = Истина;
		СправочникОбъект.Ответственный               = Пользователи.ТекущийПользователь();
	Иначе
		СправочникОбъект = ПараметрыОбработки.Ссылка.ПолучитьОбъект();
	КонецЕсли;  
	
	СправочникОбъект.Команды.Очистить();
	Для Каждого Стр Из ПараметрыОбработки.Команды Цикл
		НовСтр = СправочникОбъект.Команды.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр); 
		НовСтр.ВариантЗапуска = ПредопределенноеЗначение("Перечисление.СпособыВызоваДополнительныхОбработок."+Стр.Использование);
	КонецЦикла;
	
	ЭтоОтчет      = (ПараметрыОбработки.Вид = "ОТЧЕТ");
	АдресДанных   = ПоместитьВоВременноеХранилище(ПараметрыОбработки.ДвоичныеДанные);
	Менеджер      = ?(ЭтоОтчет, ВнешниеОтчеты, ВнешниеОбработки);
	ИмяОбъекта = Менеджер.Подключить(АдресДанных, , Истина,
	ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	ВнешнийОбъект = Менеджер.Создать(ИмяОбъекта);
	
	ВнешнийОбъектМетаданные = ВнешнийОбъект.Метаданные();
	ОбработкаСведения = ПараметрыОбработки.Сведения;
	Если ОбработкаСведения.Наименование = Неопределено ИЛИ ОбработкаСведения.Информация = Неопределено Тогда
		Если ОбработкаСведения.Наименование = Неопределено Тогда
			ОбработкаСведения.Наименование = ВнешнийОбъектМетаданные.Представление();
		КонецЕсли;
		Если ОбработкаСведения.Информация = Неопределено Тогда
			ОбработкаСведения.Информация = ВнешнийОбъектМетаданные.Комментарий;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СправочникОбъект, ОбработкаСведения, "Наименование, БезопасныйРежим, Версия, Информация");
	
	// Выгрузка настроек команд, которые переопределяются администратором.
	ПоискЗаданий = Новый Соответствие;
	Для Каждого СтараяКоманда Из СправочникОбъект.Команды Цикл
		Если ЗначениеЗаполнено(СтараяКоманда.РегламентноеЗаданиеGUID) Тогда
			ПоискЗаданий.Вставить(ВРег(СтараяКоманда.Идентификатор), СтараяКоманда.РегламентноеЗаданиеGUID);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("АдресДанныхОбработки", АдресДанных);
	ПараметрыРегистрации.Вставить("ЭтоОтчет", ЭтоОтчет);
	ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Ложь);
	ПараметрыРегистрации.Вставить("ИмяФайла", ПараметрыОбработки.ИмяФайла);
	ПараметрыРегистрации.Вставить("ОтключатьПубликацию", Ложь);
	ПараметрыРегистрации.Вставить("Версия", ОбработкаСведения.Версия); 
	ПараметрыРегистрации.Вставить("Информация", ОбработкаСведения.Информация); 
	
	СправочникОбъект.ИмяОбъекта = Неопределено;
	СправочникОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
	СправочникОбъект.Вид        =  Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка;
	
	
	//Результат = ДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(СправочникОбъект, ПараметрыРегистрации);
	//Если Не Результат.Успех Тогда
	//	ЗаписьЖурналаРегистрации(
	//	,
	//	УровеньЖурналаРегистрации.Ошибка,
	//	Метаданные.ОбщиеМакеты.Найти(ПараметрыОбработки.ИмяМакета),
	//	,
	//	Результат.ТекстОшибки);
	//	Возврат;
	//КонецЕсли;
	
	СправочникОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ПараметрыОбработки.ДвоичныеДанные);
	СправочникОбъект.ИмяОбъекта         = ВнешнийОбъектМетаданные.Имя;
	СправочникОбъект.ИмяФайла           = ПараметрыОбработки.ИмяФайла;
	
	// Очистка и загрузка новых команд.
	Для Каждого Команда Из СправочникОбъект.Команды Цикл
		РегламентноеЗаданиеGUID = ПоискЗаданий.Получить(ВРег(Команда.Идентификатор));
		Если РегламентноеЗаданиеGUID <> Неопределено Тогда
			Команда.РегламентноеЗаданиеGUID = РегламентноеЗаданиеGUID;
			ПоискЗаданий.Удалить(ВРег(Команда.Идентификатор));
		КонецЕсли;
	КонецЦикла;
	
	// Удаление неактуальных заданий.
	Для Каждого КлючИЗначение Из ПоискЗаданий Цикл
		Попытка
			Задание = РегламентныеЗаданияСервер.Задание(КлючИЗначение.Значение);
			Задание.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,, СправочникОбъект.Ссылка,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Регламентное задание ""%1"" не было удалено по причине:
			|%2'"),
			КлючИЗначение.Значение,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;
	КонецЦикла;
	
	Если ДополнительныеОтчетыИОбработки.ПроверитьГлобальнаяОбработка(СправочникОбъект.Вид) Тогда
		ТаблицаОбъектовМетаданных = ДополнительныеОтчетыИОбработки.ПодключенныеОбъектыМетаданных(СправочникОбъект.Вид);
		Для Каждого СтрокаТаблицы Из ТаблицаОбъектовМетаданных Цикл
			РазделСсылка = СтрокаТаблицы.Ссылка;
			СтрокаРаздела = СправочникОбъект.Разделы.Найти(РазделСсылка, "Раздел");
			Если СтрокаРаздела = Неопределено Тогда
				СтрокаРаздела = СправочникОбъект.Разделы.Добавить();
				СтрокаРаздела.Раздел = РазделСсылка;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ОписаниеНазначения Из ОбработкаСведения.Назначение Цикл
			ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ОписаниеНазначения);
			Если ОбъектМетаданных = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбъектНазначенияСсылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
			СтрокаНазначения = СправочникОбъект.Назначение.Найти(ОбъектНазначенияСсылка, "ОбъектНазначения");
			Если СтрокаНазначения = Неопределено Тогда
				СтрокаНазначения = СправочникОбъект.Назначение.Добавить();
				СтрокаНазначения.ОбъектНазначения = ОбъектНазначенияСсылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// АПК:1327-выкл Механизм обновления дополнительных отчетов и обработок из метаданных.
	// Конкурентной работы не предполагается.
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект, , Истина);
	// АПК:1327-вкл
	
КонецПроцедуры

Функция СведенияОВнешнейОбработкеИзФайла(АдресХранилища, ИмяФайла)   
	
	Если СтрЗаканчиваетсяНа(НРег(ИмяФайла),"epf") Тогда 
		Расширение = "epf";
	ИначеЕсли СтрЗаканчиваетсяНа(НРег(ИмяФайла),"erf") Тогда 
		Расширение = "erf"; 
	Иначе 
		Сообщить("Ошибка установки. Необходимо скачать файл и установить вручную"); 
		Возврат Неопределено;
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ИмяВремФайла = ПолучитьИмяВременногоФайла(Расширение);
    ДвоичныеДанные.Записать(ИмяВремФайла);
   
   	ОбработкаОбъект = ВнешниеОбработки.Создать(ИмяВремФайла);      
	ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
	СведенияОВнешнейОбработке = ОбработкаОбъект.СведенияОВнешнейОбработке();
	Если СведенияОВнешнейОбработке.Свойство("ИмяОбъекта") Тогда 
		Если НЕ ЗначениеЗаполнено(СведенияОВнешнейОбработке.ИмяОбъекта) Тогда 
			СведенияОВнешнейОбработке.ИмяОбъекта = ИмяОбработки;
		КонецЕсли;
	Иначе 
		СведенияОВнешнейОбработке.Вставить("ИмяОбъекта", ИмяОбработки);
	КонецЕсли;
	
	Возврат СведенияОВнешнейОбработке; 
	
КонецФункции

Функция ПолучитьРасширениеФайла(ИмяФайла)

	ПозицияПоследнейТочки = 0;
	РасширениеФайла = ИмяФайла;

	Пока Истина Цикл 
		ПозицияПоследнейТочки = Найти(РасширениеФайла, "."); 
		Если ПозицияПоследнейТочки = 0 Тогда   
			Прервать; 
		Иначе   
			РасширениеФайла = Сред(РасширениеФайла, ПозицияПоследнейТочки + 1)
		КонецЕсли;
	КонецЦикла;

	Возврат ?(РасширениеФайла = ИмяФайла, "", РасширениеФайла);

КонецФункции  


