
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	АдресХранилища = Параметры.АдресХранилища;   
	ИмяОбъекта = Параметры.ИмяОбъекта;
	МассивФайловИзХранилища = ПолучитьИзВременногоХранилища(АдресХранилища);  

	Для Каждого Эл Из МассивФайловИзХранилища Цикл  
		НовСтр = МассивФайлов.Добавить();
		НовСтр.ИмяФайла = Эл.ИмяФайла;
		НовСтр.АдресДД = ПоместитьВоВременноеХранилище(Эл.ДвоичныеДанные,УникальныйИдентификатор); 
		ИмяРасширения = ПолучитьРасширениеФайла(Эл.ИмяФайла); 
		Если НРег(ИмяРасширения)="cfe" ИЛИ НРег(ИмяРасширения) = "epf" ИЛИ НРег(ИмяРасширения) = "erf" Тогда 
			НовСтр.Установить = "Установить";  
		КонецЕсли;
		НовСтр.Скачать = "Скачать";
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.МассивФайлов.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "МассивФайловУстановить" И ТекДанные.Установить = "Установить" Тогда
		УстановитьРасширение(Элементы.МассивФайлов.ТекущаяСтрока); 
		ПроизвелиУстановку = Истина;
	ИначеЕсли Поле.Имя = "МассивФайловСкачать" И ТекДанные.Скачать = "Скачать" Тогда
		СкачатьФайл(Элементы.МассивФайлов.ТекущаяСтрока); 		
	КонецЕсли; 

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьРасширение(ТекущаяСтрока)  
	
	СтрокаФайла = МассивФайлов.НайтиПоИдентификатору(ТекущаяСтрока);
	
	УстановитьРасширениеНаСервере(СтрокаФайла.АдресДД, СтрокаФайла.ИмяФайла, ИмяОбъекта);	
	ПоказатьОповещениеПользователя("Микросервис обновлен. Для применения новой версии необходимо перезапустить сеанс 1С",,,,СтатусОповещенияПользователя.Важное);      
	
КонецПроцедуры    

&НаСервере
Процедура УстановитьРасширениеНаСервере(АдресХранилища, ИмяФайла, ИмяОбъекта) Экспорт
	
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	ОбрОбъект.УстановитьРасширениеНаСервере(АдресХранилища, ИмяФайла, ИмяОбъекта);
	
КонецПроцедуры 

&НаКлиенте
Процедура СкачатьФайл(ТекущаяСтрока) 
	
	СтрокаФайла = МассивФайлов.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.ПолноеИмяФайла = СтрокаФайла.ИмяФайла;
	ДиалогВыбораФайла.Расширение = ПолучитьРасширениеФайла(СтрокаФайла.ИмяФайла);  
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПриЗакрытииВыбораФайла", ЭтотОбъект, СтрокаФайла.АдресДД);
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);  
	
КонецПроцедуры    

&НаКлиенте
Процедура Подключаемый_ПриЗакрытииВыбораФайла(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если НЕ ВыбранныеФайлы = Неопределено Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДопПараметры);
	    Попытка
			ДвоичныеДанные.Записать(ВыбранныеФайлы[0]);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;  	
	КонецЕсли; 	
	
КонецПроцедуры



&НаКлиенте
Процедура Завершить(Команда)
	Закрыть(Новый Структура("ПроизвелиУстановку, ИмяОбъекта",ПроизвелиУстановку,ИмяОбъекта));
КонецПроцедуры  

&НаСервере
Функция ПолучитьРасширениеФайла(ИмяФайла)

	ПозицияПоследнейТочки = 0;
	РасширениеФайла = ИмяФайла;

	Пока Истина Цикл 
		ПозицияПоследнейТочки = Найти(РасширениеФайла, "."); 
		Если ПозицияПоследнейТочки = 0 Тогда   
			Прервать; 
		Иначе   
			РасширениеФайла = Сред(РасширениеФайла, ПозицияПоследнейТочки + 1)
		КонецЕсли;
	КонецЦикла;

	Возврат ?(РасширениеФайла = ИмяФайла, "", РасширениеФайла);

КонецФункции 
